### TUI
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Lua related (support neovim plugins)
brew "lua"
brew "luarocks"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Terminal-based AI coding assistant
cask "claude-code"
# Lazydocker
brew "lazydocker"
# Configurable static site generator
brew "hugo"
# Tool for managing OCI containers and pods
brew "podman"

### GUI
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Anthropic's official Claude AI desktop app
cask "claude"
# Kubernetes and container management on the desktop
cask "rancher"

### DEPS
# GNU multiple precision arithmetic library
brew "gmp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"

### FONTS
cask "font-cascadia-code-nf"
cask "font-symbols-only-nerd-font"

### Treesitter & Language Server
brew "tree-sitter-cli"
brew "bash-language-server"
brew "llvm" # clangd
brew "lua-language-server"
brew "ruby-lsp"
brew "gopls"
brew "golangci-lint"
brew "golangci-lint-langserver"
brew "templ"
brew "rust-analyzer"
brew "zls"
brew "sql-language-server"
brew "yaml-language-server"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "docker-language-server"
brew "helm-ls"
