tap "neurosnap/tap"

### TUI
# Neovim
brew "neovim"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Lua related (support neovim plugins)
brew "lua"
brew "luarocks"
# Internet file retriever
brew "wget"
# Tool for managing OCI containers and pods
brew "podman"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Command-line interface for SQLite
brew "sqlite"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Linux virtual machines
brew "lima"
# AI agent toolkit
brew "pi-coding-agent"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Official tldr client written in Rust
brew "tlrc"
# Parser generator tool
brew "tree-sitter-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Session persistence for terminal processes
brew "neurosnap/tap/zmx", trusted: true
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"

### GUI
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Anthropic's official Claude AI desktop app
cask "claude"
# Utility that prevents the system from going to sleep
cask "caffeine"

### DEPS
# GNU multiple precision arithmetic library
brew "gmp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"

### FONTS
cask "font-cascadia-code-nf"
cask "font-symbols-only-nerd-font"
